Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/irish_citizenship/your_right_to_irish_citizenship.html.txt.tmx
Source language: en
Languages: ga

source: Becoming an Irish citizen
ga: Ag éirí i do shaoránach Éireannach

source: Irish citizens are formal members of the Irish community, that is, the Irish community living in Ireland and the Irish community living abroad
ga: Tá saoránaigh de chuid na hÉireann mar bhaill fhoirmiúla de phobal na hÉireann, is é sin, pobal na hÉireann a bhfuil cónaí orthu in Éirinn agus pobal na hÉireann thar lear

source: Being an Irish citizen means that you are legally recognised as being a national of Ireland and a citizen of the European Union
ga: Ciallaíonn a bheith i do shaoránach Éireannach go bhfuil aitheantas dlíthiúil ort mar náisiúnach de chuid na hÉireann agus mar shaoránach de chuid Aontais na hEorpa

source: UK referendum: Following the UK vote to leave the European Union, the Department of Foreign Affairs and Trade has published a list of frequently asked questions on citizenship and passports for Irish and UK citizens
ga: Reifreann RA: Tar éis vóta RA chun Aontas Eorpach a fhágáil, d’fhoilsigh an Roinn Gnóthaí Eachtracha agus Trádáil liosta ceisteanna coitianta maidir le saoránacht agus pasanna do shaoránaigh Éireannacha agus do shaoránaigh RA

source: Rights of Irish citizens
ga: Cearta ag shaoránaigh Éireannacha

source: Irish citizens (in common with all citizens living in Ireland) enjoy certain rights and privileges that are guaranteed under the Irish Constitution
ga: Tá roinnt cearta agus pribhléidí ag saoránaigh Éireannacha (mar atá ag na saoránaigh ar fad a bhfuil cónaí orthu in Éirinn) atá barántaithe faoi Bhunreacht Éireann

source: Some of these rights are fundamental rights that arise from living in Ireland
ga: Tá cuid de na cearta seo ina mbunchearta a éiríonn mar thoradh ar a bheith i do chónaí in Éirinn

source: For example, if you are a citizen living in Ireland, you are entitled to equality before the law, freedom to travel, freedom of expression and religious liberty
ga: Mar shampla, más saoránach tú a bhfuil cónaí ort in Éirinn, tá tú i dteideal comhionnanas roimh an dlí, saoirse chun taistil, saoirse cainte agus saoirse creidimh

source: If you are an Irish citizen, you are entitled to carry an Irish passport and leave Ireland to travel abroad, to vote in an Irish election and to be elected to government in Ireland and in the European Union
ga: Más saoránach Éireannach tú, tá tú i dteideal pas Éireannach a bheith agat agus is féidir leat Éire a fhágáil agus taisteal thar lear, do vóta a chaitheamh i dtoghchán in Éirinn agus a bheith tofa mar bhall den rialtas in Éirinn agus in Aontas na hEorpa

source: As an Irish citizen, you are also entitled to live, travel and work within the European Union/European Economic Area
ga: Mar shaoránach Éireannach, tá tú freisin i dteideal a bheith ag maireachtáil, ag taisteal agus ag obair taobh istigh de Aontas na hEorpa/Cheantar Eacnamaíochta na hEorpa

source: As an Irish citizen living in Ireland, you also have certain duties and responsibilities
ga: Mar shaoránach Éireannach agus cónaí ort in Éirinn, tá roinnt dualgaisí agus freagrachtaí ort freisin

source: For example, you are expected to observe and uphold the basic rule of law in Ireland and to serve on a jury if called upon
ga: Mar shampla, tá dúil go gcoinneoidh tú is go gcumhdóidh tú bun-dhlí na hÉireann agus freastal ar ghiuiré má ghlaotar ort

source: If you are an Irish citizen living outside of Ireland, you are also entitled to an Irish passport, as well as diplomatic supports from Irish embassies/consulates abroad, etc
ga: Más saoránach Éireannach tú agus cónaí ort thar lear, tá tú freisin i dteideal pas Éireannach a bheith agat agus tacaíocht thaidhleoireachta ó ambasáidí agus ó oifigí consalachta de chuid na hÉireann thar lear

source: With the exception of diplomatic staff and their spouses or civil partners posted abroad, as an Irish citizen living abroad you are not entitled to vote in an Irish election by post or in your nearest Irish embassy
ga: Ach amháin i gcás fhoireann thaidhleoireachta agus a gcéilí nó a bpáirtnéirí sibhialta atá ag obair thar lear, mar shaoránach Éireannach agus cónaí ort thar lear, níl tú i dteideal vótáil i dtoghchán in Éirinn tríd an bpost nó san ambasáid Éireannach is gaire duit

source: How can I become an Irish citizen?
ga: Conas is féidir liom saoránacht Éireannach a thabhairt amach?

source: Irish citizenship is obtained in different ways
ga: Tugtar saoránacht Éireannach sna bealaí difriúla

source: Most Irish citizens get their citizenship through birth or descent
ga: Tá saoránacht an chuid is mó de na saoránaigh Éireannacha le fáil trí bhreith nó bhunadh

source: Foreign nationals can apply to become Irish citizens through naturalisation
ga: Is feidir le náisiúnaigh eachtracha iarratas a dhéanamh ar shaoránacht Éireannach trí eadóirseacht

source: If you are a foreign national who is either married to an Irish citizen or a civil partner of an Irish citizen, you can apply for Irish citizenship through naturalisation
ga: Má tá pósta nó i bpáirtnéireacht sibhialta le saoránach Éireannach is féidir leat iarratas a dhéanamh ar shaoránacht Éireannach trí eadóirseacht

source: The residence requirements are more favourable for the spouse or civil partner of an Irish citizen but there is no longer an absolute entitlement to Irish citizenship through marriage
ga: Tá na riachtanais cónaithe níos fabhraí do chéilí nó pháirtnéirí sibhialta saoránach Éireannach. Níl aon dearbh-cheart chun saoránachta trí phósadh le saoránach Éireannach

source: If you are an Irish citizen, you may also hold dual citizenship, that is, citizenship of another country. You should be aware that certain countries do not recognise dual citizenship
ga: Más saoránach Éireannach tú, tá tú freisin i dteideal saoránacht dhúbailte a bheith agat, is é sin saoránacht tíre eile

source: If you wish to apply for dual citizenship, you should check with the authorities of the other country to ensure that your rights are protected
ga: Ba cheart duit tabhairt faoi deara go bhfuil roinnt tíortha nach n-aithníonn saoránacht dhúbailte

source: For example, the law in some countries provides for the automatic termination of its citizenship or nationality if you acquire another citizenship or nationality
ga: Más mian leat iarratas a dhéanamh maidir le saoránacht dhúbailte, ba cheart dul i dteagmháil leis na húdarais sa tír eile chun a dheimhniú go ndéantar do chearta a chosaint

source: Renouncing your Irish citizenship
ga: Saoránacht Éireannach a thréigean

source: If you are an Irish citizen living abroad, and you wish to apply for citizenship of another country you may be required to renounce your Irish citizenship
ga: Más saoránach Éireannach tú agus cónaí ort thar lear, is féidir freisin do shaoránacht Éireannach a thréigean agus iarratas a dhéanamh chun saoránacht tíre eile a thabhairt amach

source: If you have done this by making a declaration of alienage (pdf) that you are no longer an Irish citizen this does not affect your entitlement to be an Irish citizen if you are born in Ireland
ga: Dá treigfeadh tú do shaoránacht trí dhearbhú eachtrannachta (pdf) ní bheadh aon toradh ar do theidlíocht saoránacht Éireannach

source: You can resume your Irish citizenship by making a declaration of citizenship (pdf)
ga: Is féidir do shaoránacht Éireannach a atosú trí dhearbhú saoránachta (pdf)

source: The Irish Naturalisation and Immigration Service (INIS) website has more information about Irish citizenship
ga: Tá tuilleadh faisnéise ar an suíomh gréasáin SEIÉ maidir le saoránacht Éireannach

source: You can also email INIS at citizenshipinfo@justice.ie
ga: Is féidir dul i dteagmháil le SEIÉ ag citizenshipinfo@justice.ie
